---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FollowSurface
source: html/22ce4b34-a2a4-9158-1cec-a70faddd1d27.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FollowSurface Property

"Follow Surface"

## Syntax (C#)
```csharp
public static ForgeTypeId FollowSurface { get; }
```